-- phpMyAdmin SQL Dump
-- version 5.1.3
-- https://www.phpmyadmin.net/
--
-- 主機： 127.0.0.1
-- 產生時間： 2022-07-05 04:51:22
-- 伺服器版本： 10.4.24-MariaDB
-- PHP 版本： 7.4.29

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- 資料庫: `greenhouse`
--

-- --------------------------------------------------------

--
-- 資料表結構 `typhoon`
--

CREATE TABLE `typhoon` (
  `id` int(11) NOT NULL,
  `no` varchar(11) NOT NULL COMMENT '編號',
  `name` varchar(255) NOT NULL COMMENT '颱風名稱(中文)',
  `name_en` varchar(255) NOT NULL COMMENT '颱風名稱(英文)',
  `latitude` decimal(10,8) NOT NULL COMMENT '緯度',
  `longitude` decimal(11,8) NOT NULL COMMENT '經度',
  `pressure` int(11) DEFAULT NULL COMMENT '中心氣壓',
  `maxWindSpeed` int(11) DEFAULT NULL COMMENT '近中心最大風速',
  `maxGustSpeed` int(11) DEFAULT NULL COMMENT '近中心最大陣風',
  `movingSpeed` int(11) DEFAULT NULL COMMENT '預測移速',
  `movingDirection` varchar(5) DEFAULT NULL COMMENT '預測移向',
  `circle_Radius` int(11) DEFAULT NULL COMMENT '暴風半徑',
  `radiusPercentProbability` int(11) DEFAULT NULL COMMENT '熱帶氣旋中心侵襲機率圓',
  `is_forecast` int(2) NOT NULL COMMENT '是否為預測(0:否；1:是)',
  `remark` text DEFAULT NULL COMMENT '觀測說明',
  `fix_Time` datetime NOT NULL COMMENT '定位時間'
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

--
-- 傾印資料表的資料 `typhoon`
--

INSERT INTO `typhoon` (`id`, `no`, `name`, `name_en`, `latitude`, `longitude`, `pressure`, `maxWindSpeed`, `maxGustSpeed`, `movingSpeed`, `movingDirection`, `circle_Radius`, `radiusPercentProbability`, `is_forecast`, `remark`, `fix_Time`) VALUES
(1, '04', '艾利', 'AERE', '18.00000000', '132.00000000', 1002, 12, 20, NULL, NULL, NULL, NULL, 0, NULL, '2022-06-30 08:00:00'),
(2, '04', '艾利', 'AERE', '18.00000000', '132.00000000', 1002, 12, 20, 0, 'N', NULL, NULL, 0, NULL, '2022-06-30 14:00:00'),
(3, '04', '艾利', 'AERE', '19.00000000', '131.00000000', 1002, 12, 20, 25, 'NW', NULL, NULL, 0, NULL, '2022-06-30 20:00:00'),
(4, '04', '艾利', 'AERE', '20.00000000', '130.50000000', 1000, 15, 23, 20, 'NNW', NULL, NULL, 0, NULL, '2022-07-01 02:00:00'),
(5, '04', '艾利', 'AERE', '20.30000000', '131.10000000', 998, 18, 25, 12, 'ENE', 100, NULL, 0, NULL, '2022-07-01 08:00:00'),
(6, '04', '艾利', 'AERE', '20.90000000', '131.10000000', 998, 18, 25, 11, 'N', 100, NULL, 0, NULL, '2022-07-01 14:00:00'),
(7, '04', '艾利', 'AERE', '21.70000000', '131.00000000', 998, 18, 25, 15, 'N', 100, NULL, 0, NULL, '2022-07-01 20:00:00'),
(8, '04', '艾利', 'AERE', '22.90000000', '130.80000000', 995, 20, 28, 22, 'N', 100, NULL, 0, NULL, '2022-07-02 02:00:00'),
(9, '04', '艾利', 'AERE', '24.70000000', '130.30000000', 995, 20, 28, 34, 'NNW', 100, NULL, 0, NULL, '2022-07-02 08:00:00'),
(10, '04', '艾利', 'AERE', '25.70000000', '129.60000000', 995, 20, 28, 22, 'NNW', 100, NULL, 0, NULL, '2022-07-02 14:00:00'),
(11, '04', '艾利', 'AERE', '26.30000000', '128.20000000', 995, 20, 28, 26, 'WNW', 100, NULL, 0, NULL, '2022-07-02 20:00:00'),
(12, '04', '艾利', 'AERE', '27.30000000', '127.50000000', 995, 20, 28, 22, 'NNW', 100, NULL, 0, NULL, '2022-07-03 02:00:00'),
(13, '04', '艾利', 'AERE', '27.70000000', '127.20000000', 998, 18, 25, 9, 'NW', 100, NULL, 0, NULL, '2022-07-03 08:00:00'),
(14, '04', '艾利', 'AERE', '28.10000000', '126.80000000', 998, 18, 25, 10, 'NW', 100, NULL, 0, NULL, '2022-07-03 14:00:00'),
(15, '04', '艾利', 'AERE', '28.50000000', '126.50000000', 998, 18, 25, 9, 'NNW', 100, NULL, 0, NULL, '2022-07-03 20:00:00'),
(16, '04', '艾利', 'AERE', '29.10000000', '126.70000000', 998, 18, 25, 12, 'NNE', 100, NULL, 0, NULL, '2022-07-04 02:00:00'),
(17, '04', '艾利', 'AERE', '30.10000000', '127.20000000', 995, 20, 28, 20, 'NNE', 100, NULL, 0, NULL, '2022-07-04 08:00:00'),
(18, '04', '艾利', 'AERE', '30.90000000', '127.90000000', 995, 20, 28, 19, 'NE', 100, NULL, 0, NULL, '2022-07-04 14:00:00'),
(19, '04', '艾利', 'AERE', '31.70000000', '128.50000000', 995, 20, 28, 18, 'NNE', 100, NULL, 0, NULL, '2022-07-04 20:00:00'),
(20, '04', '艾利', 'AERE', '32.60000000', '129.40000000', 998, 18, 25, 22, 'NE', 100, NULL, 0, '以每小時22轉17公里速度，向東北東轉東進行', '2022-07-05 02:00:00'),
(21, '04', '艾利', 'AERE', '33.00000000', '130.50000000', 998, 18, 25, 19, 'ENE', 100, 35, 1, NULL, '2022-07-05 08:00:00'),
(22, '04', '艾利', 'AERE', '33.40000000', '131.80000000', 998, 18, 25, 22, 'ENE', 100, 70, 1, NULL, '2022-07-05 14:00:00'),
(23, '04', '艾利', 'AERE', '33.80000000', '133.80000000', 1000, 15, 23, 32, 'ENE', NULL, 80, 1, '減弱為熱帶性低氣壓', '2022-07-05 20:00:00'),
(24, '04', '艾利', 'AERE', '33.90000000', '134.90000000', 1000, 15, 23, 17, 'E', NULL, 90, 1, NULL, '2022-07-06 02:00:00'),
(25, '04', '艾利', 'AERE', '34.00000000', '136.40000000', 1000, 15, 23, 12, 'E', NULL, 130, 1, NULL, '2022-07-06 14:00:00'),
(26, '03', '芙蓉', 'CHABA', '15.50000000', '117.00000000', 998, 15, 23, NULL, NULL, NULL, NULL, 0, NULL, '2022-06-29 08:00:00'),
(27, '03', '芙蓉', 'CHABA', '15.50000000', '116.50000000', 998, 15, 23, 9, 'W', NULL, NULL, 0, NULL, '2022-06-29 14:00:00'),
(28, '03', '芙蓉', 'CHABA', '16.00000000', '116.00000000', 998, 15, 23, 13, 'NW', NULL, NULL, 0, NULL, '2022-06-29 20:00:00'),
(29, '03', '芙蓉', 'CHABA', '15.50000000', '115.00000000', 998, 15, 25, 20, 'WSW', NULL, NULL, 0, NULL, '2022-06-30 02:00:00'),
(30, '03', '芙蓉', 'CHABA', '15.60000000', '114.10000000', 995, 18, 25, 16, 'W', 100, NULL, 0, NULL, '2022-06-30 08:00:00'),
(31, '03', '芙蓉', 'CHABA', '16.00000000', '114.10000000', 995, 18, 25, 7, 'N', 100, NULL, 0, NULL, '2022-06-30 14:00:00'),
(32, '03', '芙蓉', 'CHABA', '17.00000000', '115.10000000', 988, 23, 30, 26, 'NE', 120, NULL, 0, NULL, '2022-06-30 20:00:00'),
(33, '03', '芙蓉', 'CHABA', '17.70000000', '114.60000000', 982, 25, 33, 16, 'NW', 150, NULL, 0, NULL, '2022-07-01 02:00:00'),
(34, '03', '芙蓉', 'CHABA', '18.40000000', '114.10000000', 978, 28, 38, 16, 'NW', 150, NULL, 0, '以每小時14公里速度，向西北西轉西北進行', '2022-07-01 08:00:00'),
(35, '03', '芙蓉', 'CHABA', '19.20000000', '113.10000000', 978, 28, 35, 23, 'NW', 150, 25, 1, NULL, '2022-07-01 14:00:00'),
(36, '03', '芙蓉', 'CHABA', '19.50000000', '112.30000000', 972, 30, 38, 15, 'WNW', 180, 50, 1, NULL, '2022-07-01 20:00:00'),
(37, '03', '芙蓉', 'CHABA', '19.90000000', '111.70000000', 965, 33, 43, 13, 'NW', 180, 70, 1, NULL, '2022-07-02 02:00:00'),
(38, '03', '芙蓉', 'CHABA', '20.40000000', '111.20000000', 965, 33, 43, 13, 'NW', 180, 90, 1, NULL, '2022-07-02 08:00:00'),
(39, '03', '芙蓉', 'CHABA', '21.30000000', '110.20000000', 978, 28, 35, 12, 'NW', 180, 130, 1, NULL, '2022-07-02 20:00:00'),
(40, '03', '芙蓉', 'CHABA', '22.20000000', '109.40000000', 982, 25, 33, 11, 'NW', 150, 180, 1, NULL, '2022-07-03 08:00:00'),
(41, '03', '芙蓉', 'CHABA', '23.40000000', '108.70000000', 992, 20, 28, 6, 'NNW', 150, 310, 1, NULL, '2022-07-04 08:00:00'),
(42, '03', '芙蓉', 'CHABA', '24.00000000', '108.20000000', 998, 15, 23, 3, 'NW', NULL, 390, 1, '減弱為熱帶性低氣壓', '2022-07-05 08:00:00');

--
-- 已傾印資料表的索引
--

--
-- 資料表索引 `typhoon`
--
ALTER TABLE `typhoon`
  ADD PRIMARY KEY (`id`);

--
-- 在傾印的資料表使用自動遞增(AUTO_INCREMENT)
--

--
-- 使用資料表自動遞增(AUTO_INCREMENT) `typhoon`
--
ALTER TABLE `typhoon`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=43;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
